wyniki_zwykle/fio_results_xfs_nvme/block_size_2048_compression_none/lab-sec-3/fio_webserver_test_output.txt
webserver_test: (g=0): rw=randread, bs=(R) 4096B-8192B, (W) 4096B-8192B, (T) 4096B-8192B, ioengine=libaio, iodepth=32
...
fio-3.36
Starting 16 processes
webserver_test: Laying out IO file (1 file / 2048MiB)
webserver_test: Laying out IO file (1 file / 2048MiB)
webserver_test: Laying out IO file (1 file / 2048MiB)
[...]

webserver_test: (groupid=0, jobs=16): err= 0: pid=50791: Sat May  3 01:07:58 2025
  read: IOPS=275k, BW=1144MiB/s (1200MB/s)(32.0GiB/28634msec)
    slat (nsec): min=1508, max=607206, avg=3737.91, stdev=10312.93
    clat (usec): min=40, max=10355, avg=1851.22, stdev=933.36
     lat (usec): min=43, max=10371, avg=1854.95, stdev=933.72
    clat percentiles (usec):
     |  1.00th=[  408],  5.00th=[  644], 10.00th=[  791], 20.00th=[ 1020],
     | 30.00th=[ 1221], 40.00th=[ 1434], 50.00th=[ 1663], 60.00th=[ 1942],
     | 70.00th=[ 2278], 80.00th=[ 2671], 90.00th=[ 3130], 95.00th=[ 3687],
     | 99.00th=[ 4293], 99.50th=[ 4424], 99.90th=[ 4621], 99.95th=[ 4752],
     | 99.99th=[ 5080]
   bw (  MiB/s): min=  870, max= 1470, per=100.00%, avg=1147.01, stdev=13.99, samples=910
   iops        : min=211874, max=348760, avg=275706.94, stdev=3129.10, samples=910
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.14%, 500=1.93%, 750=6.32%
  lat (usec)   : 1000=10.83%
  lat (msec)   : 2=42.51%, 4=35.30%, 10=2.96%, 20=0.01%
  cpu          : usr=2.83%, sys=8.54%, ctx=6330463, majf=0, minf=1200
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=7877354,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=1144MiB/s (1200MB/s), 1144MiB/s-1144MiB/s (1200MB/s-1200MB/s), io=32.0GiB (34.4GB), run=28634-28634msec

Disk stats (read/write):
  nvme0n1: ios=7851568/7, sectors=66894512/62, merge=0/2, ticks=14521019/13, in_queue=14521032, util=61.54%